ASSIGNMENT:22

1.  Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series

In [2]:
import pandas as pd
data = [4, 8, 15, 16, 23, 42]
series=pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

2.Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it

In [5]:
var= [1,2,3,4,5,6,7,8,9,10]
series_2=pd.Series(var)
print(series_2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

3. Create a Pandas DataFrame

In [10]:
value={'Name': ['Alice', 'Bob', 'Claire'],
    'Age': [25, 30, 27],
    'Gender': ['Female', 'Male', 'Female']}

df=pd.DataFrame(value)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

4.  What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types, similar to a table in a relational database. Each column in a DataFrame is a Pandas Series object, and the rows in the DataFrame correspond to observations or samples.

In other words, a DataFrame is a collection of Pandas Series objects, each representing a column of data, with a common index that defines the rows of the DataFrame.

The main difference between a DataFrame and a Series is that a DataFrame can have multiple columns of different types, while a Series is a one-dimensional data structure with a single data type. In the example above, my_series is a one-dimensional data structure with a single column of integers, while my_df is a two-dimensional data structure with three columns of mixed types.

Another key difference is that a DataFrame has both a row index and a column index, while a Series has only a single index that applies to all of its elements. This means that we can access individual columns of a DataFrame using their column names, but we can only access elements of a Series using their integer index.

In [13]:
import pandas as pd

my_series = pd.Series([1, 2, 3, 4])

my_df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 32, 18, 47],
    'City': ['New York', 'Paris', 'London', 'San Francisco']
})

print("SERIES:\n\n", my_series)
print("DATAFRAME:\n\n", my_df)

SERIES:

 0    1
1    2
2    3
3    4
dtype: int64
DATAFRAME:

       Name  Age           City
0    Alice   25       New York
1      Bob   32          Paris
2  Charlie   18         London
3    David   47  San Francisco

5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

Pandas provides a rich set of functions to manipulate data in a DataFrame. Some common functions include:

head() and tail(): to view the first or last few rows of a DataFrame.

info(): to display a concise summary of a DataFrame, including its data types and number of non-null values.

describe(): to generate descriptive statistics about a DataFrame, such as the count, mean, standard deviation, minimum, and maximum values of each column.

sort_values(): to sort a DataFrame by one or more columns in ascending or descending order.

groupby(): to group a DataFrame by one or more columns and apply a function to each group.

drop(): to remove one or more rows or columns from a DataFrame.

fillna(): to fill missing values in a DataFrame with a specified value or method.

In [17]:
df.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [16]:
df.tail(1)

     Name  Age  Gender
2  Claire   27  Female

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [19]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [20]:
df.sort_values(by='Age',ascending=False)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female
0   Alice   25  Female

In [25]:
df.groupby('Gender')['Age'].mean()

Gender
Female    26.0
Male      30.0
Name: Age, dtype: float64

In [26]:
df.drop(0)

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, Series and DataFrame are mutable in nature, while Panel is immutable.

When you modify a Series or DataFrame object, the changes are reflected in the original object, whereas Panel objects are not designed to be modified in place. Instead, you typically create a new Panel object with the desired modifications.

7. Create a DataFrame using multiple Series. Explain with an example

In Pandas, you can create a DataFrame using multiple Series by passing a dictionary of Series objects to the pd.DataFrame() constructor. The keys of the dictionary represent the column names of the DataFrame, and the values represent the data for each column.

In [27]:
import pandas as pd

# Create three Series objects
names = pd.Series(['RAM', 'SHYAM', 'RADHA'])
ages = pd.Series([25, 32, 18])
cities = pd.Series(['KANPUR', 'NAGPUR', 'JAIPUR'])

# Create a dictionary of the Series objects
data = {'Name': names, 'Age': ages, 'City': cities}

# Create a DataFrame from the dictionary
my_df = pd.DataFrame(data)

# Print the DataFrame
print(my_df)

    Name  Age    City
0    RAM   25  KANPUR
1  SHYAM   32  NAGPUR
2  RADHA   18  JAIPUR